hudaszekpiotr/Stm32Games/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <stdlib.h>
#include "menu_screens.h"
#include "snake.h"
#include "tetris.h"
#include "enums_types.h"

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void set_screen_brightness(unsigned brightness);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define USART_TX_Pin GPIO_PIN_2
#define USART_TX_GPIO_Port GPIOA
#define USART_RX_Pin GPIO_PIN_3
#define USART_RX_GPIO_Port GPIOA
#define CS_Pin GPIO_PIN_6
#define CS_GPIO_Port GPIOA
#define LEFT_BUTTON_Pin GPIO_PIN_7
#define LEFT_BUTTON_GPIO_Port GPIOC
#define LEFT_BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define RIGHT_BUTTON_Pin GPIO_PIN_8
#define RIGHT_BUTTON_GPIO_Port GPIOA
#define RIGHT_BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define DOWN_BUTTON_Pin GPIO_PIN_9
#define DOWN_BUTTON_GPIO_Port GPIOA
#define DOWN_BUTTON_EXTI_IRQn EXTI9_5_IRQn
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA
#define SWO_Pin GPIO_PIN_3
#define SWO_GPIO_Port GPIOB
#define MENU_BUTTON_Pin GPIO_PIN_4
#define MENU_BUTTON_GPIO_Port GPIOB
#define MENU_BUTTON_EXTI_IRQn EXTI4_IRQn
#define UP_BUTTON_Pin GPIO_PIN_6
#define UP_BUTTON_GPIO_Port GPIOB
#define UP_BUTTON_EXTI_IRQn EXTI9_5_IRQn

/* USER CODE BEGIN Private defines */
#define ADXL345_ADDR 0x53<<1
#define REG_POWER_CTL 0x2D
#define REG_DATA_FORMAT 0x31
#define DATAX0 0x32
#define DATAY0 0x34
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
